from string import Template

#### Rag Prompts (Arabic) #####

### system ###

system_prompt = Template("\n".join([
    "أنت مساعد لتوليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب عليك توليد الإجابة بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير المتعلقة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد إجابة.",
    "يجب أن تكون الإجابة بنفس لغة استفسار المستخدم.",
    "كن مهذباً وتحترم المستخدم.",
    "كن دقيقاً ومختصراً في إجابتك، وتجنب المعلومات غير الضرورية."
]))

### Document ###

Document_prompt = Template(
    "\n".join([
        "### رقم_المستند: $doc_num",
        "## المحتوى: $chunk_text "
    ])
)

### Footer ###

Footer_prompt = Template(
    "\n".join([
        "بناءً على المستندات أعلاه يرجى توليد الإجابة للمستخدم.",
        "## الإجابة: ",
    ])
)
